## 1) Start by loading the cleaned file

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
fname= 'Data/title.basics.cleaned.csv'
basics = pd.read_csv(fname, low_memory=False)

In [2]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
fname= 'Data/title.ratings.cleaned.csv'
ratings = pd.read_csv(fname, low_memory=False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [4]:
basics['startYear'] = basics['startYear'].astype(int)
basics.loc[:,'startYear']

0        2001
1        2020
2        2018
3        2005
4        2002
         ...
86974    2019
86975    2019
86976    2019
86977    2020
86978    2020
Name: startYear, Length: 86979, dtype: int32

In [5]:
# Calculate the max string lengths for object columns
basics['primaryTitle'].map(len).max()

242

In [6]:
# Calculate the max string lengths for object columns
basics['genres'].map(len).max()

29

In [7]:
# Calculate the max string lengths for object columns
basics['tconst'].map(len).max()

10

## 2) Design and Create the Database Model/ERD
<img src='Data/movie-model.png' alt='ERD model img'>

In [9]:
from sqlalchemy import create_engine, text
import pymysql
pymysql.install_as_MySQLdb()
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "movie"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [10]:
q = """
SHOW tables;
"""
# Pass the query though the text function before running read_sql
pd.read_sql(text(q), conn)

  Tables_in_movie
0          genres
1         ratings
2    title_basics
3    title_genres

## 3) Insert Title Basics and Ratings Data with Python
- For each table, run a DESCRIBE table command to display the column details (including data type).

In [11]:
q = """
DESCRIBE genres;
"""
# Pass the query though the text function before running read_sql
describe = pd.read_sql(text(q), conn)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [12]:
q = """
DESCRIBE title_genres;
"""
# Pass the query though the text function before running read_sql
describe = pd.read_sql(text(q), conn)
describe

      Field         Type Null Key Default Extra
0    tconst  varchar(45)   NO        None
1  genre_id          int   NO        None

In [13]:
q = """
DESCRIBE title_basics;
"""
# Pass the query though the text function before running read_sql
describe = pd.read_sql(text(q), conn)
describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(300)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [14]:
q = """
DESCRIBE ratings;
"""
# Pass the query though the text function before running read_sql
describe = pd.read_sql(text(q), conn)
describe

             Field           Type Null  Key Default Extra
0           tconst    varchar(45)   NO  PRI    None
1   average_rating  decimal(10,2)  YES         None
2  number_of_votes            int  YES         None

- Prepare the title_basics and ratings DataFrames for the database.- 
Use df.to_sql to append the data to the correct tables.

In [15]:
rename_map={'primaryTitle':'primary_title','startYear':'start_year','runtimeMinutes':'runtime'}
basics = basics.rename(rename_map,axis=1)
part_basic = basics[['tconst','primary_title','start_year','runtime']]
part_basic.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [16]:
# Inserting the data now 
part_basic.to_sql("title_basics",conn,index=False, if_exists='append')

86979

In [17]:
rename_map={'averageRating':'average_rating','numVotes':'number_of_votes'}
ratings = ratings.rename(rename_map,axis=1)
ratings.head()

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [18]:
# Inserting the data now 
ratings.to_sql("ratings",conn,index=False, if_exists='append')

71900

In [21]:
q = """
DESCRIBE title_basics;
"""
pd.read_sql(text(q), conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(300)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [22]:
q = """
DESCRIBE ratings;
"""
pd.read_sql(text(q), conn)

             Field           Type Null  Key Default Extra
0           tconst    varchar(45)   NO  PRI    None
1   average_rating  decimal(10,2)  YES         None
2  number_of_votes            int  YES         None

In [20]:
q = """
SELECT * FROM ratings LIMIT 5;
"""
pd.read_sql(text(q), conn)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [23]:
q = """
SELECT * FROM title_basics LIMIT 5;
"""
pd.read_sql(text(q), conn)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [25]:
q = """
SELECT * FROM genres LIMIT 5;
"""
pd.read_sql(text(q), conn)

Empty DataFrame
Columns: [genre_id, genre_name]
Index: []

In [24]:
q = """
SELECT * FROM title_genres LIMIT 5;
"""
pd.read_sql(text(q), conn)

Empty DataFrame
Columns: [tconst, genre_id]
Index: []